[
    {
        "id": 1,
        "title": "Supply Chain Performance & Sales Intelligence Dashboard",
        "para": "This project delivers a full analytical experience for supply chain and commercial performance.Using Excel datasets cleaned through Power Query and modeled in Power BI, the dashboard uncovers sales patterns, order behavior across regions, and product performance metrics—including dynamic KPI visuals and an animated globe for geographic insights.It highlights end-to-end BI development skills including ETL, data modeling, DAX, and dashboard storytelling.",
         "img": "https://i.postimg.cc/nr9dGD1H/Screenshot-2025-12-03-113947.png" , "https://i.postimg.cc/nr9dGD1J/Screenshot-2025-12-03-114101.png" , "https://i.postimg.cc/RhJPLHTx/Screenshot-2025-12-03-114143.png" , "https://i.postimg.cc/XqB2kCgY/Screenshot-2025-12-03-114234.png" , "https://i.postimg.cc/hhF2ytCB/Screenshot-2025-12-03-114304.png" , "https://i.postimg.cc/G90X7mMm/Screenshot-2025-12-03-114328.png"
    },
    {
        "id": 2,
        "title": "Uber Trip Analysis Dashboard — End-to-End Data Analytics Project",
        "para": "An end-to-end data analytics project built with Excel and Power BI. Multiple Excel files were ingested, consolidated and cleaned using Power Query; the data model was designed with optimized relationships and calculated columns. I created DAX measures to calculate KPIs such as Total Bookings, Booking Value, Average Trip Distance, Avg Trip Duration, and Day/Night breakdowns. The deliverable includes three interactive dashboards: Overview (summary KPIs, payment & trip type breakdowns), Time Analysis (hourly/weekday heatmap, pickup-time trends), and Trip Details (row-level table). The dashboards enable deep exploration of booking patterns, vehicle performance, and location-based insights to support operational decisions."
        "img": "https://i.postimg.cc/V6pn02xx/Screenshot-2025-09-07-133216.png" , "https://i.postimg.cc/mDJC1KvK/Screenshot-2025-09-07-133337.png" , "https://i.postimg.cc/j5mPnGVV/Screenshot-2025-09-07-133446.png"
    },
    {
        "id": 3,
        "title": "Wish Clothing Sales Analytics — Data Cleaning, Modeling & Interactive Dashboard",
        "para": "This project transforms raw Excel sales data for clothing products sold on Wish into a clean and structured analytical model. Using Python, I performed data cleaning, feature extraction, and exploratory analysis. Power BI was used to build the data model, create calculated columns and DAX measures, and design a dynamic dashboard showcasing sales, profit, product performance, and geographic insights. The results provide actionable business intelligence to improve pricing, stock management, marketing strategy, and product optimization."
         "img": "https://i.postimg.cc/G3kh0ZMh/Screenshot-2025-08-27-164821.png" , "https://i.postimg.cc/SR7yWM2F/Screenshot-2025-08-27-161347.png"
    },
    {
        "id": 4,
        "title": "hello this is Project title",
        "para": "this project is about testing some features online so idk what to do rn"
    },
    {
        "id": 5,
        "title": "hello this is Project title",
        "para": "this project is about testing some features online so idk what to do rn"
    },
    {
        "id": 6,
        "title": "hello this is Project title",
        "para": "this project is about testing some features online so idk what to do rn"
    },
    {
        "id": 7,
        "title": "دا تجربة لمحمود",
        "para": "حاجات عن المشروع"
    }
]
